Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: The point with a default of center that defines the location within the view from which to apply the transformation.
ja: centerという初期状態でのポイント、それはビュー内部の位置を定義するものです、それからこの変換を適用することになります。

source: The positioning anchor which defines where the popover is attached.
ja: 位置決めアンカー、それはポップオーバーが添付されるところを定義します。

source: The possible types of color schemes, like Dark Mode.
ja: カラースキームの可能な型、Dark Modeのような。

source: The predicate must be a equivalence relation over the elements.
ja: 述部は要素に対して同値関係でなければなりません。

source: The predicate must be a strict weak ordering over the elements.
ja: 述部は、それら要素に対して厳密弱順序でなければなりません。

source: The predicate orders errors before successes and sorts the error responses by their error code.
ja: この述部はエラーを成功の前に並べて、そしてそれらエラー応答をそのエラーコードによってソートします。

source: The preferred interface style for this view controller.
ja: ビューコントローラに対する好ましいインターフェイススタイル。

source: The preferred size of the content.
ja: 内容の好ましい大きさ。

source: The preferred status bar style for the view controller.
ja: ビューコントローラに対する好ましいステータスバースタイル。

source: The previous value may be captured by the closure to compare it to the new value.
ja: 以前の値は、クロージャによってキャプチャされて、それを新しい値と比較するかもしれません。

source: The properties of a button.
ja: あるボタンのプロパティそれら。

source: The properties of an open reference file document.
ja: あるオープンリファレンスファイル書類のプロパティ。

source: The properties of the button.
ja: ボタンのプロパティ。

source: The properties to copy from the source view.
ja: ソースビューからコピーすることになるプロパティ。

source: The proposed new size for the view.
ja: ビューに対して提案した新しい大きさ。

source: The provided item will be placed in the center of the row.
ja: 提供された項目は、列の中心に置かれるでしょう。

source: The public identifier of the external entity referenced in the XML document.
ja: XML書類において参照される外部エンティティのパブリック識別子。

source: The radial size of the blur.
ja: ぼかしの半径寸法。

source: The random number generator to use when choosing a random element.
ja: ある無作為の要素を選ぶ時に使う乱数生成子。

source: The random number generator to use when shuffling the sequence.
ja: シーケンスをシャッフルする時に使う乱数生成子。

source: The range expression is converted to a concrete subrange relative to this collection.
ja: 範囲式は、このコレクションに関連するある具体的な下位範囲へ変換されます。

source: The ratio of width to height to use for the resulting view.
ja: 高さに対する幅の割合、結果のビューに対して使います。

source: The raw value with which to create the key modifier.
ja: それでキー修飾子を作成することになる生の値。

source: The raw value.
ja: 生の値。

source: The receiver's read file handle.
ja: レシーバのもつ読み出しファイルハンドル。

source: The receiver's write file handle.
ja: レシーバのもつ書き出しファイルハンドル。

source: The relative location in the view used to produce its shared position value.
ja: ビューにおける相対位置、それの共有位置値を生成するのに使われます。

source: The relative vanishing point with a default of 1 for this rotation.
ja: この回転に対して1の初期状態をもつ相対的消点。

source: The remainder of the relational operator functions are implemented by the standard library for any type that conforms to Comparable.
ja: 関係演算子関数の残りは、Comparableに準拠するあらゆる型のために標準ライブラリによって実装されます。

source: The required number of tap events.
ja: 必要とされるタップイベントの数。

source: The required number of taps to complete the tap gesture.
ja: そのタップジェスチャを完了するのに要するタップの数。

source: The result of executing the closure with the specified transaction.
ja: クロージャをその指定されたトランザクションで遂行する結果。

source: The resulting array consists of at most maxSplits + 1 subsequences.
ja: 結果の配列は、多くともmaxSplits + 1の下位シーケンスから成ります。

source: The resulting flattened array.
ja: 結果として生じる平たくされた配列。

source: The resulting subsequence does not include the element at the position end.
ja: 結果となるシーケンスは、位置endでの要素を含みません。

source: The resulting subsequence includes the element at the position end.
ja: 結果となるシーケンスは、位置endでの要素を含みます。

source: The resulting view shows only the portion of the image that lies within the bounds of the circle.
ja: 結果のビューは、画像の一部だけを示します、それは円形の境界内にあるものです。

source: The returned path contains the region between from and to, both of which must be fractions between zero and one defining points linearly-interpolated along the path.
ja: 返されるパスは、fromとtoの間の領域を含みます、その両方とも、パスに沿って線形補間された点を定義している、ゼロと１の間の小数でなければなりません。

source: The root transaction for a state change comes from the binding that changed, plus any global values set by calling withTransaction(_:_:) or withAnimation(_:_:).
ja: ある状態変化に対するルートトランザクションは、その変化したバインディング、加えてwithTransaction(_:_:)またはwithAnimation(_:_:)を呼び出すことによって設定されたあらゆるグローバルな値、の産物です。

source: The root view of the SwiftUI view hierarchy managed by this view controller.
ja: このビューコントローラによって管理されるSwiftUIビュー階層のルートビュー。

source: The root view of the SwiftUI view hierarchy that you want to manage using the hosting view controller.
ja: SwiftUIビュー階層のルートビュー、それはあなたがホスティングビューコントローラを使って管理を望むものです。

source: The root view of the SwiftUI view hierarchy that you want to manage using this hosting controller.
ja: SwiftUIビュー階層のルートビュー、それはあなたがこのホスティングビューコントローラを使って管理を望むものです。

source: The root view of the SwiftUI view hierarchy that you want to manage using this view controller.
ja: あなたがこのビューコントローラを使って管理したいSwiftUIビュー階層のルートビュー。

source: The root view of the view hierarchy to display for your interface controller.
ja: あなたのインターフェイスコントローラに表示するビュー階層のルートビュー。

source: The root view of the view hierarchy to display for your notification interface.
ja: あなたの通知インターフェイスに表示するビュー階層のルートビュー。

source: The safe area inset of the container view.
ja: コンテナビューの安全地帯インセット。

source: The scale to apply to vector images relative to text.
ja: ベクター画像へ適用する縮尺、テキストに相対的に。

source: The scroll view displays its content within the scrollable content region.
ja: スクロールビューは、それの内容をスクロール可能なコンテンツ領域内に表示します。

source: The scroll view’s content.
ja: スクロールビューのもつ内容。

source: The scroll view’s scrollable axis.
ja: スクロールビューのもつスクロール可能な軸。

source: The scrollable axes of the scroll view.
ja: そのスクロールビューのスクロール可能な軸。

source: The second VStack contains a button and a slider both of which adopt the purple accent color of their containing view.
ja: ２番目のVStackはボタンとスライダーを含みます、その両方とも、それらを包含しているビューの紫のアクセントカラーを採用します。

source: The second argument is an array of NSItemProvider that represents the data that you want to insert.
ja: ２番目の引数は、あなたが挿入したいデータを表すNSItemProviderそれらからなるある配列です。

source: The second circle is outlined with a stroke, positioned on top of the first circle and offset by 100 points to the left and 50 points below.
ja: ２つの目の円はあるストロークで輪郭を描かれます、最初の円の上部に置かれます、そして100ポイント左にそして50ポイント下に補われます。

source: The second ellipse has only its height fixed, at 100; its width still expands to fill its parent’s dimensions.
ja: ２番目の楕円はそれの高さのみ固定されます、100に；それの幅は依然としてそれの親のもつ次元それらいっぱいに広がります。

source: The second example passes 1 for the maxSplits parameter, so the original string is split just once, into two new strings.
ja: ２番目の例は1をmaxSplitsパラメータに渡します、それで元の文字列は一度だけ分割されて、２つの新しい文字列になります。

source: The second gesture in a sequence of two gestures.
ja: 連続する２つのジェスチャにおける２番目のジェスチャ。

source: The second gesture of the sequence.
ja: その連続の２番目のジェスチャ。

source: The second gesture’s value.
ja: ２番目のジェスチャのもつ値。

source: The second of two gestures succeeded.
ja: うまくいった２つのジェスチャの２番目のもの。

source: The second of two gestures that can happen simultaneously.
ja: 同時に起こることが可能な２つのゼスチャの２番目のもの。

source: The second of two gestures.
ja: ２つのジェスチャの２番目のもの。

source: The second parameter contains the drop location in this view’s coordinate space.
ja: ２番目のパラメータは、このビューのもつ座標空間の中のドロップ位置を含みます。

source: The second text view to compare.
ja: 比較する第二のテキスト。

source: The second text view with text to combine.
ja: 結合するテキストをもつ２番目のテキストビュー。

source: The second truncation mode to compare.
ja: 比較する第二の切り詰めモード。

source: The second value to add.
ja: 加算する第２の値。

source: The second value.
ja: 秒の値。

source: The sequence’s maximum element if the sequence is not empty; otherwise, nil.
ja: シーケンスが空でないならばシーケンスの最大の要素；そうでなければnil。

source: The sequence’s maximum element.
ja: シーケンスの最大の要素。

source: The sequence’s minimum element, according to areInIncreasingOrder.
ja: シーケンスの最小の要素、areInIncreasingOrderによる。

source: The sequence’s minimum element.
ja: シーケンスの最小の要素。

source: The set of edges along which to inset this view.
ja: それに沿ってこのビューに差し込みをする一揃いの縁。

source: The set of the edges in which to expand the size requested for this view.
ja: 一揃いの縁それら、それらにおいてこのビューに要請された大きさを拡張することになります。

source: The set of the edges on which to ignore the safe area.
ja: それの上で安全領域を無視することになる一揃いの縁。

source: The shadow’s color.
ja: 影の色。

source: The shadow’s size.
ja: 影の大きさ。

source: The simulator device that runs a preview.
ja: プレビューを走らせるシミュレータデバイス。

source: The size classes, like regular or small, that you can apply to controls within a view.
ja: サイズクラス、レギュラーまたはスモールのような、それはあなたがビュー内のコントロールに適用できるものです。

source: The size constraint for a preview.
ja: プレビューに対するサイズ制約。

source: The size of a pixel on the screen.
ja: 画面上のあるピクセルの大きさ。

source: The size of the container view.
ja: コンテナビューの大きさ。

source: The size proposed to this view is the size proposed to the frame, limited by any constraints specified, and with any ideal dimensions specified replacing any corresponding unspecified dimensions in the proposal.
ja: このビューに提案されるサイズは、このフレームに提案されるサイズです、それは、あらゆる指定される制約によって制限され、そしてその提案におけるあらゆる対応する未指定の次元を置換するように指定されたあらゆる理想的次元をもちます。

source: The size that offers the best fit for the root view and its contents.
ja: ルートビューとそれの内容に最もよく合うと申し出る大きさ。

source: The size to apply to controls within a view.
ja: あるビュー内のコントロールに適用する大きさ。

source: The smallest encoding to which the receiver can be converted without loss of information.
ja: レシーバが情報の損失無しに変換できる最小の符号化を返します。

source: The sorting algorithm is not guaranteed to be stable.
ja: ソートアルゴリズムは、安定であることを保証されません。

source: The spacing to use between individual characters in this text.
ja: このテキストの中の個々の文字の間に使う空き。

source: The state of the Toggle, either on or off.
ja: Toggleの状態、onかoffのどちらか。

source: The string the scanner will scan.
ja: スキャナーが走査する文字列。

source: The string value to display without localization.
ja: ローカライゼーションなしに表示する文字列。

source: The stroke characteristics — such as the line’s width and whether the stroke is dashed — that determine how to render this shape.
ja: 筆致の特徴 — たとえば線のもつ幅そして筆致が中線にされる（ダッシュ）かなど — それはこの形状をどのように描出するかを決定します。

source: The subscript notation is preferred over prefix(through:).
ja: 添え字表記法は、prefix(through:)よりも好まれます。

source: The subscript notation is preferred over suffix(from:).
ja: 添え字表記法は、suffix(from:)よりも好まれます。

source: The subscript notation is preferred over prefix(upTo:).
ja: 添え字表記法は、prefix(upTo:)よりも好まれます。

source: The system automatically chooses the label of the button for the appropriate locale.
ja: システムは、自動的にボタンのラベルを適切なロケールに対して選びます。

source: The system calls the action closure on the main thread, so avoid long-running tasks in the closure.
ja: システムは、actionクロージャをメインスレッド上で呼び出します、なのでクロージャの中で長く動作するタスクを避けてください。

source: The system calls the methods of your custom instance at appropriate times.
ja: システムは、あなたのあつらえのインスタンスを適時に呼び出します。

source: The system calls the methods of your representable instance at appropriate times to create and update the interface object.
ja: システムは、あなたの表現可能なインスタンスのメソッドを適時に呼び出して、インターフェイスオブジェクトを作成および更新します。

source: The system calls the methods of your representable instance at appropriate times to create and update the view.
ja: システムは、あなたの表現可能なインスタンスのメソッドを適時に呼び出して、ビューを作成および更新します。

source: The system calls this method for each Button instance in a view hierarchy where this style is the current button style.
ja: システムは、このメソッドを、各Buttonインスタンスに対して、このスタイルが現在のボタンスタイルであるところのあるビュー階層において呼び出します。

source: The system calls this method only once, when it creates your interface object for the first time.
ja: システムは、このメソッドをただ１度だけ呼び出します、それがあなたのインターフェイスオブジェクトを初めて作成する時に。

source: The system calls this method only once, when it creates your view controller for the first time.
ja: システムは、このメソッドをそれがあなたのビューコントローラを初めて作成する時に一度だけ呼び出します。

source: The system calls this method only once, when it creates your view for the first time.
ja: システムは、このメソッドをそれがあなたのビューを初めて作成する時に一度だけ呼び出します。

source: The system color picker UI sets it’s title using the text from this view.
ja: システムカラーピッカ−UIは、それのタイトルをこのビューからのテキストを使って設定します。

source: The system determines the visual ordering of the buttons.
ja: システムは、ボタンの視覚的並びを決定します。

source: The system doesn't automatically communicate changes occurring within your interface object to other parts of your SwiftUI interface.
ja: システムは、あなたのインターフェイスオブジェクト内で発生する変化をあなたのSwiftUIインターフェイスの他の部分に自動的に伝達しません。

source: The system doesn't automatically communicate changes occurring within your view controller to other parts of your SwiftUI interface.
ja: システムは、あなたのビューコントローラ内で発生する変化をあなたのSwiftUIインターフェイスの他の部分に自動的に伝達しません。

source: The system doesn't automatically communicate changes occurring within your view to other parts of your SwiftUI interface.
ja: システムは、あなたのビュー内で発生する変化をあなたのSwiftUIインターフェイスの他の部分に自動的に伝達しません。

source: The system identifier of the external entity referenced in the XML document.
ja: XML書類において参照される外部エンティティのシステム識別子。

source: The system passes the new value into the closure.
ja: システムは、新しい値をクロージャへと渡します。

source: The system provides your coordinator either directly or as part of a context structure when calling the other methods of your representable instance.
ja: システムは、あなたのコーディネータを直接にまたはある前後関係構造体の一部としてのどちらかで提供します、あなたの表現可能インスタンスの他のメソッドを呼び出す時に。

source: The system provides your coordinator instance either directly or as part of a context structure when calling the other methods of your representable instance.
ja: システムは、あなたのコーディネータインスタンスを直接にまたはある前後関係構造体の一部としてのどちらかで提供します、あなたの表現可能インスタンスの他のメソッドを呼び出す時に。

source: The system resolves a font’s value at the time it uses the font in a given environment because Font is a late-binding token.
ja: システムはあるフォントのもつ値を、それがそのフォントをある与えられた環境において使う時点で解決します、なぜならFontは遅延バインディングのトークンだからです。

source: The system resolves this configuration at runtime.
ja: システムは、この構成設定を実行時に解決します。

source: The system uses the accent color for common controls and containers.
ja: システムは、アクセントカラーを共通のコントロールおよびコンテナに対して使います。

source: The thickness of the border.
ja: 境界線の太さ。

source: The time associated with the current event.
ja: 現在のイベントと結びつけられた時間。

source: The time associated with the drag gesture’s current event.
ja: ドラッグジェスチャのもつ現在のイベントと結びつけられた時間。

source: The title displayed by the color picker.
ja: カラーピッカーによって表示されるタイトル。

source: The title of the modal interface is set to Cancel by default, but you can change the title using the setTitle(_:) method.
ja: モーダルインターフェイスのタイトルは、Cancelに初期状態では設定されます、しかしあなたはタイトルをsetTitle(_:)メソッドを使って変更できます。

source: The top level disclosure group exposes its expanded state with the bound property, topLevelExpanded.
ja: トップレベルの開示グループは、それの展開状態を束縛プロパティ、topLevelExpandedで露出します。

source: The total translation from the first event to the current event.
ja: 最初のイベントから現在のイベントまでの全転換。

source: The total translation from the start of the drag gesture to the current event of the drag gesture.
ja: ドラッグジェスチャの始まりからドラッグジェスチャの現在のイベントまでの総変換。

source: The transaction captures the information needed to update the view when the binding value changes.
ja: トランザクションは、バインドしている値が変化する時にビューを更新するのに必要とされる情報をキャプチャします。

source: The transaction to apply when setting a new value.
ja: 新しい値を設定する時に適用するトランザクション。

source: The transaction used for any changes to the binding’s value.
ja: バインディングのもつ値へのあらゆる変更に対して使われるトランザクション。

source: The transformation applies to all child views within this view; calling transaction(_:) on a container view can lead to unbounded scope.
ja: 変形は、このビュー内の全ての子ビューに適用されます；transaction(_:)をコンテナビュー上で呼び出すことは、無制限スコープに至る可能性があります。

source: The transformation to apply to transactions within this view.
ja: このビュー内のトランザクションに適用する変形。

source: The truncation mode that specifies where to truncate the text within the text view, if needed.
ja: 切り詰めモード、それはテキストを切り詰める場所をテキストビュー内で指定します、必要ならば。

source: The truncation mode.
ja: 切り詰めモード。

source: The two loops in the following example produce the same output:
ja: 以下の例における２つのループは、同じ出力を生み出します：

source: The type defined for the constants that specify the kind and subkind of DTD declaration represented by an NSXMLDTDNode object.
ja: NSXMLDTDNodeオブジェクトによって表されるDTD宣言の種類と下位種類を指定する定数それらに対して定義される型。

source: The type defining the data to animate.
ja: アニメーション化するデータを定義している型。

source: The type of WatchKit interface object to be presented.
ja: 提示されることになるWatchKitインターフェイスオブジェクトの型。

source: The type of command group representing the body of this command group.
ja: このコマンドグループの本体を表しているコマンドグループの型。

source: The type of document being viewed.
ja: 視聴されている書類の型。

source: The type of gesture representing the body of Self.
ja: ジェスチャの型、Selfのボディを表しています。

source: The type of gesture representing the gesture’s body.
ja: ジェスチャのボディを表しているジェスチャの型。

source: The type of modifier to use after being resolved.
ja: 解決される後に使う修飾子の型。

source: The type of the inset shape.
ja: インセット（縁差込）形状の型。

source: The type of the underlying collection of data.
ja: 基礎をなすデータのコレクションの型。

source: The type of truncation to apply to a line of text when it’s too long to fit in the available space.
ja: それが利用可能な空間に収まるには長すぎるところのテキストのある行に適用する切り詰めの型。

source: The type of value produced by this gesture.
ja: このジェスチャによって生み出される値の型。

source: The type of value produced by this preference.
ja: この環境設定によって生み出された値の型。

source: The type of view controller to present.
ja: 提示するビューコントローラの型。

source: The type of view representing the body of the view.
ja: ビューのボディを表しているビューの型。

source: The type of view representing the body of this view.
ja: このビューの本体を表しているビューの型。

source: The type of view representing the body.
ja: ボディを表しているビューの型。

source: The type of view to present.
ja: 提示するビューの型。

source: The type representing the gesture’s value.
ja: ジェスチャの持つ値を表している型。

source: The type to preview.
ja: プレビューすることになる型。

source: The underlying value referenced by the binding variable.
ja: バインディング変数によって参照される基礎をなす値。

source: The underlying value referenced by the environment object.
ja: 環境オブジェクトによって参照される基礎をなす値。

source: The underlying value referenced by the observed object.
ja: 監視されるオブジェクトによって参照される基礎をなす値。

source: The underlying value referenced by the state variable.
ja: 状態変数によって参照される基礎をなす値。

source: The undo manager that views should use to register undo operations.
ja: アンドゥマネージャ、それはビューがアンドゥ操作を登録するのに使うべきものです。

source: The undo manager used to register a view’s undo operations.
ja: ビューのもつアンドゥ操作を登録するために使われるアンドゥマネージャ。

source: The uniform type identifiers that describe the types of content this view can accept through drag and drop.
ja: ユニホーム型識別子いくつか、それらはこのビューがドラッグ＆ドロップを通して受け入れ可能な内容の型を記述します。

source: The unwrapped value for the focus key given the current scope and state of the focused view hierarchy.
ja: 現在のスコープとそのフォーカスされたビュー階層の状態を与えられて、このフォーカスキーに対するアンラップされた値。

source: The updating gesture containing the originating gesture’s value, the updated state of the gesture, and a transaction.
ja: 起源とするジェスチャのもつ値、ジェスチャの更新された状態、そしてあるトランザクションを含んでいる更新ジェスチャ。

source: The upper bound for the range.
ja: 範囲の上側の境界。

source: The user can also dismiss the interface by tapping the title.
ja: ユーザは、またインターフェイスを退出させることがタイトルをタップすることで可能です。

source: The user can navigate to other interface controllers by swiping horizontally.
ja: ユーザは、他のインターフェイスコントローラになんとか進むことが水平にスワイプすることで可能です。

source: The user defaults store to read and write to.
ja: それに読み出しおよび書き出しするuser defaults store。

source: The user generates an exit command by pressing the Menu button on tvOS, or the escape key on macOS.
ja: ユーザは退出命令を、MenuボタンをtvOS上で、またはエスケープキーをmacOS上で押すことによって生成します。

source: The user sets the Increase Contrast option using the Settings app.
ja: ユーザは、「コントラストを上げる」オプションを「設定」Appを使って設定します。

source: The user’s choice can't be overridden by the app.
ja: ユーザの選択は、アプリによってオーバーライドされることができません。

source: The usual transition mechanisms define how each of the two views is rendered during the transition (e.g. fade in/out, scale, etc), the matchedGeometryEffect() modifier only arranges for the geometry of the views to be linked, not their rendering.
ja: 通常の遷移（トランジション）機構はどのように２つのビューのそれぞれが遷移の間に描出されるかを定義します（すなわち、はっきりしてくる／消えていく、拡大縮小、など）、matchedGeometryEffect()修飾子はビューの幾何学を手配してリンクされるようにするだけです、それらの描出はしません。

source: The value accumulated through previous calls to this method.
ja: このメソッドに対する以前の呼び出しを通して蓄積された値。

source: The value must conform to the Equatable protocol.
ja: 値は、Equatableプロトコルに準拠しなければなりません。

source: The value of a long-press gesture.
ja: ある長押しゼスチャの値。

source: The value of a sequence gesture that helps to detect whether the first gesture succeeded, so the second gesture can start.
ja: ある連続ジェスチャの値、それは最初のジェスチャが成功したかどうかを検出するのに役立ちます、それで２番目のジェスチャは開始できません。

source: The value of a simultaneous gesture that indicates which of its two gestures receives events.
ja: ある同時のジェスチャの値、それは、それの２つのジェスチャのどちらがイベントを受け取るかを指し示します。

source: The value of an exclusive gesture that indicates which of two gestures succeeded.
ja: ある排他的ジェスチャの値、それは２つのジェスチャのうちどちらが成功したかを指し示します。

source: The value of the corresponding guide in the given context.
ja: 対応するガイドのこの与えられた前後関係における値。

source: The value of the first gesture.
ja: 最初のジェスチャの値。

source: The value of the new instance.
ja: 新しいインスタンスのための値。

source: The value of the second gesture.
ja: ２番目のジェスチャの値。

source: The value passed as distance must not offset i beyond the bounds of the collection, unless the index passed as limit prevents offsetting beyond those bounds.
ja: distanceとして渡される値は、このコレクションの境界を越えてiを補ってはいけません、limitとして渡されるインデックスがそれらの境界を越えて補うのを防止するのでない限りは。

source: The value passed as distance must not offset i beyond the bounds of the collection.
ja: distanceとして渡される値は、このコレクションの境界を越えてiを補ってはなりません。

source: The value to check against when determining whether to run the closure.
ja: クロージャを走らせるかどうかを決定する時にこの値と照合することになります。

source: The value to check when determining whether to run the closure.
ja: クロージャを走らせるかどうかを決定する時に検査する値。

source: The value to subtract from lhs.
ja: lhsから減じる値。

source: The value to use as the initial accumulating value.
ja: 初めから蓄積される値として使われる値。

source: The value will settle on multiples of stride.
ja: 値は、複数のstrideの集まりでしょう。

source: The vertical amount, in points, by which you offset the shape.
ja: 垂直量、ポイントで、それだけあなたは形状を位置埋め合わせします。

source: The vertical distance to offset this view.
ja: このビューを補うための垂直間隔。

source: The vertical size class of this environment.
ja: この環境の垂直サイズ等級。

source: The view builder that creates the scrollable view.
ja: スクロール可能ビューを作成するビュービルダー。

source: The view builder that creates views dynamically.
ja: ビューを動的に作成するビュービルダー。

source: The view calculates this to be the space needed to represent the entire string.
ja: ビューは、これを計算して、全体の文字列を表すのに必要とされる空間であるようにします。

source: The view content can be edited.
ja: ビュー内容は、編集されことができます。

source: The view content cannot be edited.
ja: ビュー内容は、編集されことができません。

source: The view gives values to these properties prior to recomputing the view’s body.
ja: ビューは、値をこれらのプロパティに与えます、ビューのもつbodyを再計算するに先立って。

source: The view ignores the transform returned by this method while the view is performing its layout calculations.
ja: ビューはこのメソッドによって返される遷移を無視します、ビューがそれのレイアウト計算を実行している間に。

source: The view is in a temporary edit mode.
ja: ビューは、一時的編集モードにあります。

source: The view to layer in front of the view.
ja: ビューの前において層に重ねるビュー。

source: The viewing UI for the provided document.
ja: 提供された書類に対する視聴UI。

source: The view’s associated coordinator.
ja: ビューのもつ関連コーディネータ。

source: The view’s height.
ja: ビューのもつ高さ。

source: The view’s width.
ja: ビューのもつ幅。

source: The way to display the title.
ja: タイトルを表示する方法。

source: The working color space and storage format of the image.
ja: 画像の作業色空間とストレージフォーマット。

source: The working color space for color-compositing operations.
ja: 色合成演算に対する作業色空間。

source: The wrapped value of a GestureState property.
ja: GestureStateプロパティのラップされた値。

source: The wrapped value referenced by the gesture state property.
ja: ジェスチャ状態プロパティによって参照されるラップされた値。

source: The x-coordinate at which to place the center of this view.
ja: それにこのビューの中心を置くことになるx座標。

source: The y-coordinate at which to place the center of this view.
ja: それにこのビューの中心を置くことになるy座標。

source: The zero value.
ja: ゼロ値。

source: The “past the end” index of the resulting subsequence.
ja: 結果のシーケンスの「終わりを過ぎた」インデックス。
